Информационная_база/src/Documents/ПроводкиМесяца/ПроводкиМесяца.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроводкиМесяца</name>
  <registerRecords>AccountingRegister.РегистрБухгалтерии</registerRecords>
  <attributes>
    <name>Прибыль</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Информационная_база/src/ChartsOfAccounts/БухУчет/БухУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>БухУчет</name>
  <predefined>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41   </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Расчеты</name>
      <description>Расчеты</description>
      <code>62   </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>Клиенты</name>
        <description>Клиенты</description>
        <code>62.01</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>Поставщики</name>
        <description>Поставщики</description>
        <code>62.02</code>
        <accountType>ActivePassive</accountType>
      </childItems>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50   </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Продажи</name>
      <description>Продажи</description>
      <code>90   </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>Выручка</name>
        <description>Выручка</description>
        <code>90.01</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>Себестоимость</name>
        <description>Себестоимость</description>
        <code>90.02</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>Прибыль</name>
        <description>Прибыль / убыток от прода</description>
        <code>90.09</code>
        <accountType>ActivePassive</accountType>
        <offBalance>true</offBalance>
      </childItems>
    </items>
  </predefined>
</mdclass:ChartOfAccounts>

Информационная_база/src/Documents/ПроводкиМесяца/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция РасчетИтогов(Начало, Конец)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(РегистрБухгалтерииОстаткиИОбороты.СуммаОборот, 0) КАК СуммаОборотов
	|ИЗ
	|	РегистрБухгалтерии.РегистрБухгалтерии.ОстаткиИОбороты(&Начало, &Конец,,, Счет = &Счет,) КАК РегистрБухгалтерииОстаткиИОбороты";
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.БухУчет.Себестоимость);
	Запрос.УстановитьПараметр("Начало",Начало);
	Запрос.УстановитьПараметр("Конец", Конец);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Себестоимость = Выборка.СуммаОборотов;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ЕСТЬNULL(РегистрБухгалтерииОстаткиИОбороты.СуммаОборот, 0) КАК СуммаОборотов
	|ИЗ
	|	РегистрБухгалтерии.РегистрБухгалтерии.ОстаткиИОбороты(&Начало, &Конец,,, Счет = &Счет,) КАК
	|		РегистрБухгалтерииОстаткиИОбороты";
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.БухУчет.Выручка);
	Запрос.УстановитьПараметр("Начало",Начало);
	Запрос.УстановитьПараметр("Конец", Конец);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Выручка = Выборка.СуммаОборотов;
	
	Прибыль = -(Выручка + Себестоимость);
	Возврат Прибыль;
	
КонецФункции


&НаКлиенте
Процедура РасчетИтоговЗаМесяц(Команда)
	Начало = НачалоМесяца(Объект.Дата);
	Конец = КонецМесяца(Объект.Дата);
	
	Объект.Прибыль = РасчетИтогов(Начало, Конец);
КонецПроцедуры
